tutorials/incompressible/pimpleSolver/les/motorBike/motorBikeSS/0.org/include/initialConditions
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

flowVelocity         (20 0 0);
pressure             0;
turbulentKE          0.24;
turbulentOmega       1.78;
#inputMode           merge

// ************************************************************************* //
