tutorials/incompressible/pimpleSolver/les/motorBike/motorBikeSS/0.org/k
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.24;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.24;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.24;
        value           uniform 0.24;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 0.24;
    }
    "motorBike_.*"
    {
        type            kqRWallFunction;
        value           uniform 0.24;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            symmetryPlane;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
