tutorials/incompressible/pimpleSolver/les/motorBike/motorBikeSS/system/controlDict
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleSolver;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression true;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    readFields
    {
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        type            readFields;
        fields          ( p U );
    }
    streamLines
    {
        type            streamLine;
        writeControl    outputTime;
        setFormat       vtk;
        UName            U;
        trackForward    true;
        fields          ( p U );
        lifeTime        10000;
        nSubCycle       5;
        cloudName       particleTracks;
        seedSampleSet   uniform;
        uniformCoeffs
        {
            type            uniform;
            axis            x;
            start           ( -1.001 1e-07 0.0011 );
            end             ( -1.001 1e-07 1.0011 );
            nPoints         20;
        }
    }
    cuttingPlane
    {
        type            surfaces;
        functionObjectLibs ( "libsampling.so" );
        writeControl    outputTime;
        surfaceFormat   vtk;
        fields          ( p U );
        interpolationScheme cellPoint;
        surfaces        ( yNormal { type cuttingPlane ; planeType pointAndNormal ; pointAndNormalDict { basePoint ( 0 0 0 ) ; normalVector ( 0 1 0 ) ; } interpolate true ; } );
    }
    forces
    {
        type            forceCoeffs;
        functionObjectLibs ( "libforces.so" );
        writeControl    timeStep;
        writeInterval   1;
        patches         ( "motorBike.*" );
        pName           p;
        UName           U;
        rhoName         rhoInf;
        log             true;
        rhoInf          1;
        liftDir         ( 0 0 1 );
        dragDir         ( 1 0 0 );
        CofR            ( 0.72 0 0 );
        pitchAxis       ( 0 1 0 );
        magUInf         20;
        lRef            1.42;
        Aref            0.75;
    }
}


// ************************************************************************* //
